Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/lunyu__all__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 君召使擯，色勃如也，足躩如也。揖所與立，左右手，衣前後，襜如也。趨進，翼如也。賓退，必復命，曰：「賓不顧矣。」
en: When the prince called him to employ him in the reception of a visitor, his countenance appeared to change, and his legs to move forward with difficulty. He inclined himself to the other officers among whom he stood, moving his left or right arm, as their position required, but keeping the skirts of his robe before and behind evenly adjusted. He hastened forward, with his arms like the wings of a bird. When the guest had retired, he would report to the prince, "The visitor is not turning round any more."

source: 入公門，鞠躬如也，如不容。立不中門，行不履閾。過位，色勃如也，足躩如也，其言似不足者。攝齊升堂，鞠躬如也，屛氣似不息者。出，降一等，逞顏色，怡怡如也。沒階趨進，翼如也。復其位，踧踖如也。
en: When he entered the palace gate, he seemed to bend his body, as if it were not sufficient to admit him. When he was standing, he did not occupy the middle of the gate-way; when he passed in or out, he did not tread upon the threshold. When he was passing the vacant place of the prince, his countenance appeared to change, and his legs to bend under him, and his words came as if he hardly had breath to utter them. He ascended the reception hall, holding up his robe with both his hands, and his body bent; holding in his breath also, as if he dared not breathe. When he came out from the audience, as soon as he had descended one step, he began to relax his countenance, and had a satisfied look. When he had got to the bottom of the steps, he advanced rapidly to his place, with his arms like wings, and on occupying it, his manner still showed respectful uneasiness.

source: 執圭，鞠躬如也，如不勝。上如揖，下如授，勃如戰色，足蹜蹜如有循。享禮，有容色。私覿，愉愉如也。
en: When he was carrying the scepter of his ruler, he seemed to bend his body, as if he were not able to bear its weight. He did not hold it higher than the position of the hands in making a bow, nor lower than their position in giving anything to another. His countenance seemed to change, and look apprehensive, and he dragged his feet along as if they were held by something to the ground. In presenting the presents with which he was charged, he wore a placid appearance. At his private audience, he looked highly pleased.

source: 君子不以紺緅飾，紅紫不以爲褻服；當暑，袗絺綌，必表而出之。緇衣羔裘，素衣麑裘，黃衣狐裘。褻裘長，短右袂。（必有寢衣，長一身有半。）狐貉之厚以居。去喪，無所不佩。非帷裳，必殺之。羔裘玄冠，不以弔。吉月，必朝服而朝。
en: The superior man did not use a deep purple, or a puce colour, in the ornaments of his dress. Even in his undress, he did not wear anything of a red or reddish colour. In warm weather, he had a single garment either of coarse or fine texture, but he wore it displayed over an inner garment. Over lamb's fur he wore a garment of black; over fawn's fur one of white; and over fox's fur one of yellow. The fur robe of his undress was long, with the right sleeve short. He required his sleeping dress to be half as long again as his body. When staying at home, he used thick furs of the fox or the badger. When he put off mourning, he wore all the appendages of the girdle. His under-garment, except when it was required to be of the curtain shape, was made of silk cut narrow above and wide below. He did not wear lamb's fur or a black cap, on a visit of condolence. On the first day of the month he put on his court robes, and presented himself at court.

source: 齊，必有明衣，布。齊必變食，居必遷坐。
en: When fasting, he thought it necessary to have his clothes brightly clean and made of linen cloth. When fasting, he thought it necessary to change his food, and also to change the place where he commonly sat in the apartment.

source: 食不厭精，膾不厭細。食饐而餲，魚餒而肉敗，不食。色惡不食，臭惡不食。失飪不食，不時不食。割不正不食，不得其醬不食。肉雖多，不使勝食氣。唯酒無量，不及亂。沽酒市脯不食。不撤薑食，不多食。祭于公，不宿肉。祭肉不出三日，出三日，不食之矣。食不語，寢不言。雖疏食菜羹瓜祭，必齊如也。
en: He did not dislike to have his rice finely cleaned, nor to have his minced meat cut quite small. He did not eat rice which had been injured by heat or damp and turned sour, nor fish or flesh which was gone. He did not eat what was discoloured, or what was of a bad flavour, nor anything which was ill-cooked, or was not in season. He did not eat meat which was not cut properly, nor what was served without its proper sauce. Though there might be a large quantity of meat, he would not allow what he took to exceed the due proportion for the rice. It was only in wine that he laid down no limit for himself, but he did not allow himself to be confused by it. He did not partake of wine and dried meat bought in the market. He was never without ginger when he ate. He did not eat much. When he had been assisting at the prince's sacrifice, he did not keep the flesh which he received overnight. The flesh of his family sacrifice he did not keep over three days. If kept over three days, people could not eat it. When eating, he did not converse. When in bed, he did not speak. Although his food might be coarse rice and vegetable soup, he would offer a little of it in sacrifice with a grave, respectful air.

source: 席不正不坐。
en: If his mat was not straight, he did not sit on it.

source: 鄉人飮酒，杖者出，斯出矣。鄉人儺，朝服而立於阼階。
en: When the villagers were drinking together, on those who carried staffs going out, he went out immediately after. When the villagers were going through their ceremonies to drive away pestilential influences, he put on his court robes and stood on the eastern steps.

source: 問人於他邦，再拜而送之。康子饋藥，拜而受之，曰：「丘未達，不敢嘗。」
en: When he was sending complimentary inquiries to any one in another State, he bowed twice as he escorted the messenger away. Chi K'ang having sent him a present of physic, he bowed and received it, saying, "I do not know it. I dare not taste it."

source: 廄焚，子退朝，曰：「傷人乎？」不問馬。
en: The stable being burned down, when he was at court, on his return he said, "Has any man been hurt?" He did not ask about the horses.

source: 君賜食，必正席先嘗之。君賜腥，必熟而薦之。君賜生，必畜之。侍食於君，君祭，先飯。疾，君視之，東首，加朝服拖紳。君命召，不俟駕行矣。
en: When the prince sent him a gift of cooked meat, he would adjust his mat, first taste it, and then give it away to others. When the prince sent him a gift of undressed meat, he would have it cooked, and offer it to the spirits of his ancestors. When the prince sent him a gift of a living animal, he would keep it alive. When he was in attendance on the prince and joining in the entertainment, the prince only sacrificed. He first tasted everything. When he was ill and the prince came to visit him, he had his head to the east, made his court robes be spread over him, and drew his girdle across them. When the prince's order called him, without waiting for his carriage to be yoked, he went at once.

source: 入太廟，每事問。
en: When he entered the ancestral temple of the State, he asked about everything.

source: 朋友死，無所歸，曰：「於我殯。」朋友之饋，雖車馬，非祭肉，不拜。
en: When any of his friends died, if he had no relations who could be depended on for the necessary offices, he would say, "I will bury him." When a friend sent him a present, though it might be a carriage and horses, he did not bow. The only present for which he bowed was that of the flesh of sacrifice.

source: 寢不尸，居不容。見齊衰者，雖狎必變。見冕者與瞽者，雖褻必以貌。凶服者式之。式負版者。有盛饌，必變色而作。迅雷，風烈，必變。
en: In bed, he did not lie like a corpse. At home, he did not put on any formal deportment. When he saw any one in a mourning dress, though it might be an acquaintance, he would change countenance; when he saw any one wearing the cap of full dress, or a blind person, though he might be in his undress, he would salute them in a ceremonious manner. To any person in mourning he bowed forward to the crossbar of his carriage; he bowed in the same way to any one bearing the tables of population. When he was at an entertainment where there was an abundance of provisions set before him, he would change countenance and rise up. On a sudden clap of thunder, or a violent wind, he would change countenance.

source: 升車，必正立，執綏。車中不內顧，不疾言，不親指。
en: When he was about to mount his carriage, he would stand straight, holding the cord. When he was in the carriage, he did not turn his head quite round, he did not talk hastily, he did not point with his hands.

source: 色斯擧矣，翔而後集。曰：「山梁雌雉，時哉時哉！」子路共之，三嗅而作。
en: Seeing the countenance, it instantly rises. It flies round, and by and by settles. The Master said, "There is the hen-pheasant on the hill bridge. At its season! At its season!" Tsze-lu made a motion to it. Thrice it smelt him and then rose.

source: 子曰：「先進於禮樂，野人也；後進於禮樂，君子也。如用之，則吾從先進。」
en: The Master said, "The men of former times, in the matters of ceremonies and music were rustics, it is said, while the men of these latter times, in ceremonies and music, are accomplished gentlemen. "If I have occasion to use those things, I follow the men of former times."

source: 子曰：「從我於陳蔡者，皆不及門也。」德行：顏淵、閔子騫、冉伯牛、仲弓。言語：宰我、子貢。政事：冉有、季路。文學：子游、子夏。
en: The Master said, "Of those who were with me in Ch'an and Ts'ai, there are none to be found to enter my door." Distinguished for their virtuous principles and practice, there were Yen Yuan, Min Tsze-ch'ien, Zan Po-niu, and Chung-kung; for their ability in speech, Tsai Wo and Tsze-kung; for their administrative talents, Zan Yu and Chi Lu; for their literary acquirements, Tsze-yu and Tsze-hsia.

source: 子曰：「回也，非助我者也！於吾言，無所不說。」
en: The Master said, "Hui gives me no assistance. There is nothing that I say in which he does not delight."

source: 子曰：「孝哉，閔子騫！人不間於其父母昆弟之言。」
en: The Master said, "Filial indeed is Min Tsze-ch'ien! Other people say nothing of him different from the report of his parents and brothers."

source: 南容三復《白圭》，孔子以其兄之子妻之。
en: Nan Yung was frequently repeating the lines about a white scepter stone. Confucius gave him the daughter of his elder brother to wife.

source: 季康子問：「弟子孰爲好學？」孔子對曰：「有顏回者好學，不幸短命死矣。今也則亡。」
en: Chi K'ang asked which of the disciples loved to learn. Confucius replied to him, "There was Yen Hui; he loved to learn. Unfortunately his appointed time was short, and he died. Now there is no one who loves to learn, as he did."

source: 顏淵死，顏路請子之車以爲之槨。子曰：「才不才，亦各言其子也。鯉也死，有棺而無槨。吾不徒行以爲之槨，以吾從大夫之後，不可徒行也。」
en: When Yen Yuan died, Yen Lu begged the carriage of the Master to sell and get an outer shell for his son's coffin. The Master said, "Every one calls his son his son, whether he has talents or has not talents. There was Li; when he died, he had a coffin but no outer shell. I would not walk on foot to get a shell for him, because, having followed in the rear of the great officers, it was not proper that I should walk on foot."

source: 顏淵死，子曰：「噫！天喪予！天喪予！」
en: When Yen Yuan died, the Master said, "Alas! Heaven is destroying me! Heaven is destroying me!"

source: 顏淵死，子哭之慟。從者曰：「子慟矣！」曰：「有慟乎？非夫人之爲慟而誰爲？」
en: When Yen Yuan died, the Master bewailed him exceedingly, and the disciples who were with him said, "Master, your grief is excessive?" "Is it excessive?" said he. "If I am not to mourn bitterly for this man, for whom should I mourn?"

source: 顏淵死，門人欲厚葬之。子曰：「不可。」門人厚葬之。子曰：「回也，視予猶父也，予不得視猶子也；非我也，夫二三子也。」
en: When Yen Yuan died, the disciples wished to give him a great funeral, and the Master said, "You may not do so." The disciples did bury him in great style. The Master said, "Hui behaved towards me as his father. I have not been able to treat him as my son. The fault is not mine; it belongs to you, O disciples."

source: 季路問事鬼神。子曰：「未能事人，焉能事鬼？」「敢問死？」曰：「未知生，焉知死？」
en: Chi Lu asked about serving the spirits of the dead. The Master said, "While you are not able to serve men, how can you serve their spirits?" Chi Lu added, "I venture to ask about death?" He was answered, "While you do not know life, how can you know about death?"

source: 閔子侍側，誾誾如也；子路，行行如也；冉有、子貢，侃侃如也。子樂。「若由也，不得其死然！」
en: The disciple Min was standing by his side, looking bland and precise; Tsze-lu, looking bold and soldierly; Zan Yu and Tsze-kung, with a free and straightforward manner. The Master was pleased. He said, "Yu, there!—he will not die a natural death."

source: 魯人爲長府。閔子騫曰：「仍舊貫，如之何？何必改作？」子曰：「夫人不言，言必有中。」
en: Some parties in Lu were going to take down and rebuild the Long Treasury. Min Tsze-ch'ien said, "Suppose it were to be repaired after its old style;—why must it be altered and made anew?" The Master said, "This man seldom speaks; when he does, he is sure to hit the point."

source: 子曰：「由之瑟，奚爲於丘之門？」門人不敬子路。子曰：「由也升堂矣，未入於室也！」
en: The Master said, "What has the lute of Yu to do in my door?" The other disciples began not to respect Tsze-lu. The Master said, "Yu has ascended to the hall, though he has not yet passed into the inner apartments."

source: 子貢問：「師與商也孰賢？」子曰：「師也過，商也不及。」曰：「然則師愈與？」子曰：「過猶不及。」
en: Tsze-kung asked which of the two, Shih or Shang, was the superior. The Master said, "Shih goes beyond the due mean, and Shang does not come up to it." "Then," said Tsze-kung, "the superiority is with Shih, I suppose." The Master said, "To go beyond is as wrong as to fall short."

source: 季氏富於周公，而求也爲之聚斂而附益之。子曰：「非吾徒也！小子鳴鼓而攻之，可也。」
en: The head of the Chi family was richer than the duke of Chau had been, and yet Ch'iu collected his imposts for him, and increased his wealth. The Master said, "He is no disciple of mine. My little children, beat the drum and assail him."

source: 柴也愚，參也魯，師也辟，由也喭。
en: Ch'ai is simple. Shan is dull. Shih is specious. Yu is coarse.

source: 子曰：「回也其庶乎，屢空。賜不受命，而貨殖焉；億則屢中。」
en: The Master said, "There is Hui! He has nearly attained to perfect virtue. He is often in want. "Ts'ze does not acquiesce in the appointments of Heaven, and his goods are increased by him. Yet his judgments are often correct."

source: 子張問「善人」之道。子曰：「不踐跡，亦不入於室。」
en: Tsze-chang asked what were the characteristics of the good man. The Master said, "He does not tread in the footsteps of others, but moreover, he does not enter the chamber of the sage."

source: 子曰：「論篤是與，君子者乎？色莊者乎？」
en: The Master said, "If, because a man's discourse appears solid and sincere, we allow him to be a good man, is he really a superior man? or is his gravity only in appearance?"

source: 子路問：「聞斯行諸？」子曰：「有父兄在，如之何其聞斯行之？」冉有問：「聞斯行諸？」子曰：「聞斯行之。」公西華曰：「由也問：『聞斯行諸？』子曰：『有父兄在。』求也問：『聞斯行諸？』子曰：『聞斯行之。』赤也惑，敢問。」子曰：「求也退，故進之；由也兼人，故退之。」
en: Tsze-lu asked whether he should immediately carry into practice what he heard. The Master said, "There are your father and elder brothers to be consulted;—why should you act on that principle of immediately carrying into practice what you hear?" Zan Yu asked the same, whether he should immediately carry into practice what he heard, and the Master answered, "Immediately carry into practice what you hear." Kung-hsi Hwa said, "Yu asked whether he should carry immediately into practice what he heard, and you said, 'There are your father and elder brothers to be consulted.' Ch'iu asked whether he should immediately carry into practice what he heard, and you said, 'Carry it immediately into practice.' I, Ch'ih, am perplexed, and venture to ask you for an explanation." The Master said, "Ch'iu is retiring and slow; therefore, I urged him forward. Yu has more than his own share of energy; therefore I kept him back."

source: 子畏於匡，顏淵後。子曰：「吾以女爲死矣！」曰：「子在，回何敢死？」
en: The Master was put in fear in K'wang and Yen Yuan fell behind. The Master, on his rejoining him, said, "I thought you had died." Hui replied, "While you were alive, how should I presume to die?"

source: 季子然問：「仲由、冉求可謂大臣與？」子曰：「吾以子爲異之問，曾由與求之問？所謂大臣者，以道事君，不可則止。今由與求也，可謂具臣矣。」曰：「然則從之者與？」子曰：「弒父與君，亦不從也。」
en: Chi Tsze-zan asked whether Chung Yu and Zan Ch'iu could be called great ministers. The Master said, "I thought you would ask about some extraordinary individuals, and you only ask about Yu and Ch'iu! "What is called a great minister, is one who serves his prince according to what is right, and when he finds he cannot do so, retires. "Now, as to Yu and Ch'iu, they may be called ordinary ministers." Tsze-zan said, "Then they will always follow their chief;—will they?" The Master said, "In an act of parricide or regicide, they would not follow him."

source: 子路使子羔爲費宰。子曰：「賊夫人之子。」子路曰：「有民人焉，有社稷焉；何必讀書，然後爲學？」子曰：「是故惡夫佞者。」
en: Tsze-lu got Tsze-kao appointed governor of Pi. The Master said, "You are injuring a man's son." Tsze-lu said, "There are (there) common people and officers; there are the altars of the spirits of the land and grain. Why must one read books before he can be considered to have learned?" The Master said, "It is on this account that I hate your glib-tongued people."

source: 子路、曾皙、冉有、公西華侍坐。子曰：「以吾一日長乎爾，毋吾以也。居則曰：『不吾知也。』如或知爾，則何以哉？」子路率爾而對，曰：「千乘之國，攝乎大國之閒，加之以師旅，因之以饑饉，由也爲之，比及三年，可使有勇，且知方也。」夫子哂之。「求，爾何如？」對曰：「方六七十，如五六十，求也爲之，比及三年，可使足民；如其禮樂，以俟君子。」「赤，爾何如？」對曰：「非曰能之，願學焉！宗廟之事，如會同，端章甫，願爲小相焉。」「點，爾何如？」鼓瑟希，鏗爾，舍瑟而作；對曰：「異乎三子者之撰。」子曰：「何傷乎？亦各言其志也。」曰：「莫春者，春服既成。冠者五六人，童子六七人。浴乎沂，風乎舞雩，詠而歸。」夫子喟然歎曰：「吾與點也！」三子者出，曾皙後。曾皙曰：「夫三子者之言何如？」子曰：「亦各言其志也已矣。」曰：「夫子何哂由也？」曰：「爲國以禮，其言不讓，是故哂之。」「唯求則非邦也與？」「安見方六七十，如五六十，而非邦也者？」「唯赤則非邦也與？」「宗廟會同，非諸侯而何？赤也爲之小，孰能爲之大？」
en: Tsze-lu, Tsang Hsi, Zan Yu, and Kung-hsi Hwa were sitting by the Master. He said to them, "Though I am a day or so older than you, do not think of that. "From day to day you are saying, 'We are not known.' If some ruler were to know you, what would you like to do?" Tsze-lu hastily and lightly replied, "Suppose the case of a State of ten thousand chariots; let it be straitened between other large States; let it be suffering from invading armies; and to this let there be added a famine in corn and in all vegetables:—if I were intrusted with the government of it, in three years" time I could make the people to be bold, and to recognise the rules of righteous conduct." The Master smiled at him. Turning to Yen Yu, he said, "Ch'iu, what are your wishes?" Ch'iu replied, "Suppose a state of sixty or seventy li square, or one of fifty or sixty, and let me have the government of it;—in three years" time, I could make plenty to abound among the people. As to teaching them the principles of propriety, and music, I must wait for the rise of a superior man to do that." "What are your wishes, Ch'ih," said the Master next to Kung-hsi Hwa. Ch'ih replied, "I do not say that my ability extends to these things, but I should wish to learn them. At the services of the ancestral temple, and at the audiences of the princes with the sovereign, I should like, dressed in the dark square-made robe and the black linen cap, to act as a small assistant." Last of all, the Master asked Tsang Hsi, "Tien, what are your wishes?" Tien, pausing as he was playing on his lute, while it was yet twanging, laid the instrument aside, and rose. "My wishes," he said, "are different from the cherished purposes of these three gentlemen." "What harm is there in that?" said the Master; "do you also, as well as they, speak out your wishes." Tien then said, "In this, the last month of spring, with the dress of the season all complete, along with five or six young men who have assumed the cap, and six or seven boys, I would wash in the I, enjoy the breeze among the rain altars, and return home singing." The Master heaved a sigh and said, "I give my approval to Tien." The three others having gone out, Tsang Hsi remained behind, and said, "What do you think of the words of these three friends?" The Master replied, "They simply told each one his wishes." Hsi pursued, "Master, why did you smile at Yu?" He was answered, "The management of a State demands the rules of propriety. His words were not humble; therefore I smiled at him." Hsi again said, "But was it not a State which Ch'iu proposed for himself?" The reply was, "Yes; did you ever see a territory of sixty or seventy li or one of fifty or sixty, which was not a State?" Once more, Hsi inquired, "And was it not a State which Ch'ih proposed for himself?" The Master again replied, "Yes; who but princes have to do with ancestral temples, and with audiences but the sovereign? If Ch'ih were to be a small assistant in these services, who could be a great one?

source: 顏淵問「仁」。子曰：「克己復禮爲仁。一日克己復禮，天下歸仁焉，爲仁由己，而由人乎哉？」顏淵曰：「請問其目。」子曰：「非禮勿視，非禮勿聽，非禮勿言，非禮勿動。」顏淵曰：「回雖不敏，請事斯語矣！」
en: Yen Yuan asked about perfect virtue. The Master said, "To subdue one's self and return to propriety, is perfect virtue. If a man can for one day subdue himself and return to propriety, all under heaven will ascribe perfect virtue to him. Is the practice of perfect virtue from a man himself, or is it from others?" Yen Yuan said, "I beg to ask the steps of that process." The Master replied, "Look not at what is contrary to propriety; listen not to what is contrary to propriety; speak not what is contrary to propriety; make no movement which is contrary to propriety." Yen Yuan then said, "Though I am deficient in intelligence and vigour, I will make it my business to practise this lesson."

source: 仲弓問「仁」。子曰：「出門如見大賓，使民如承大祭，己所不欲，勿施於人。在邦無怨，在家無怨。」仲弓曰：「雍雖不敏，請事斯語矣！」
en: Chung-kung asked about perfect virtue. The Master said, "It is, when you go abroad, to behave to every one as if you were receiving a great guest; to employ the people as if you were assisting at a great sacrifice; not to do to others as you would not wish done to yourself; to have no murmuring against you in the country, and none in the family." Chung-kung said, "Though I am deficient in intelligence and vigour, I will make it my business to practise this lesson."

source: 司馬牛問「仁」。子曰：「仁者，其言也訒。」曰：「其言也訒，斯謂之『仁』已夫？」子曰：「爲之難，言之得無訒乎！」
en: Sze-ma Niu asked about perfect virtue. The Master said, "The man of perfect virtue is cautious and slow in his speech." "Cautious and slow in his speech!" said Niu;—"is this what is meant by perfect virtue?" The Master said, "When a man feels the difficulty of doing, can he be other than cautious and slow in speaking?"

source: 司馬牛問「君子」。子曰：「君子不憂不懼。」曰：「不憂不懼，斯謂之『君子』矣夫？」子曰：「內省不疚，夫何憂何懼！」
en: Sze-ma Niu asked about the superior man. The Master said, "The superior man has neither anxiety nor fear." "Being without anxiety or fear!" said Nui;—"does this constitute what we call the superior man?" The Master said, "When internal examination discovers nothing wrong, what is there to be anxious about, what is there to fear?"

source: 司馬牛憂曰：「人皆有兄弟，我獨亡！」子夏曰：「商聞之矣：『死生有命，富貴在天』君子敬而無失，與人恭而有禮，四海之內，皆兄弟也，君子何患乎無兄弟也！」
en: Sze-ma Niu, full of anxiety, said, "Other men all have their brothers, I only have not." Tsze-hsia said to him, "There is the following saying which I have heard:— "'Death and life have their determined appointment; riches and honours depend upon Heaven.' "Let the superior man never fail reverentially to order his own conduct, and let him be respectful to others and observant of propriety:—then all within the four seas will be his brothers. What has the superior man to do with being distressed because he has no brothers?"

source: 子張問「明」。子曰：「浸潤之譖，膚受之愬，不行焉，可謂明也已矣。浸潤之譖，膚受之愬，不行焉，可謂遠也已矣。」
en: Tsze-chang asked what constituted intelligence. The Master said, "He with whom neither slander that gradually soaks into the mind, nor statements that startle like a wound in the flesh, are successful, may be called intelligent indeed. Yea, he with whom neither soaking slander, nor startling statements, are successful, may be called farseeing."

source: 子貢問「政」。子曰：「足食，足兵，民信之矣。」子貢曰：「必不得已而去，於斯三者何先？」曰：「去兵。」子貢曰：「必不得已而去，於斯二者何先？」曰：「去食。自古皆有死，民無信不立。」
en: Tsze-kung asked about government. The Master said, "The requisites of government are that there be sufficiency of food, sufficiency of military equipment, and the confidence of the people in their ruler." Tsze-kung said, "If it cannot be helped, and one of these must be dispensed with, which of the three should be foregone first?" "The military equipment," said the Master. Tsze-kung again asked, "If it cannot be helped, and one of the remaining two must be dispensed with, which of them should be foregone?" The Master answered, "Part with the food. From of old, death has been the lot of all men; but if the people have no faith in their rulers, there is no standing for the state."
